---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.AnalyticalModelWallTopProjection
source: html/71a315e3-54db-cfc0-78ae-9aa8d0ed947c.htm
---
# Autodesk.Revit.DB.ParameterTypeId.AnalyticalModelWallTopProjection Property

"Top y Projection"

## Syntax (C#)
```csharp
public static ForgeTypeId AnalyticalModelWallTopProjection { get; }
```